[{"movieTitle":"Kingsman: The Golden Circle","movieYear":"2017","moviePoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTBlOWZhZTctOTY0MC00Y2QyLTljMmYtZDkxZDFlMWU4Y2EyXkEyXkFqcGdeQXVyNDg2MjUxNjM@._V1_SY1000_CR0,0,675,1000_AL_.jpg","movieDescription":"When their headquarters are destroyed and the world is held hostage, the Kingsman's jour ney leads them to the discovery of an allied spy organization in the US. These two elite secret organizations must band together to defeat a common enemy.","id":1},{"movieTitle":"Jumanji: Welcom e to the Jungle","movieYear":"2017","moviePoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNDQ1MDc5OV5BMl5BanBnXkFtZTgwOTcyNzI2MzI@._V1_.jpg","movieDescription":"Four teenagers discover an old video game console and are literally drawn into the game's jungle setting becoming the adult avatars they choose.","id":2},{"movieTitle":"Rurouni Kenshin","mov ieYear":"2012","moviePoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgzODM2MjUyMF5BMl5BanBnXkFtZTgwMzg4MjA1OTE@._V1_SY1000_CR0,0,679,1000_AL_.jpg","movieDescription":"In 1868, after the end of the Bakumatsu war, the former assassin Kenshin Himura promises to defend those in need without killing. Kenshin wanders through Japan with a reve rse-edged sword during the transition of the samurai age to the New Age. When Kenshin helps the idealistic Kaoru Kamiya from the gangsters of the powerful opium drug lord Kanryuu Takeda tha t wants her school for his production of opium, Kaoru invites Kenshin to stay in the school. But the drug chemist Megumi Takani escapes from Kanryuu and seeks shelter in the school. Meanw hile the killer Battosai is murdering police officers and leaving messages attached to their bodies. When Kanryuu poisons the population to get the school, Kenshin and the street fighter  Sanosuke Sagara join forces to attack their common enemy.","id":3},{"movieTitle":"Donnie Darko","movieYear":"2001","moviePoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjZlZDlkYTktMmU1My00ZDBiLWFlNjEtYTBhNjVhOTM4ZjJjXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg","movieDescription":"Donnie Darko doesn't get along too well with his family, his teachers and his  classmates; but he does manage to find a sympathetic friend in Gretchen, who agrees to date him. He has a compassionate psychiatrist, who discovers hypnosis is the means to unlock hi dden secrets. His other companion may not be a true ally. Donnie has a friend named Frank - a large bunny which only Donnie can see. When an engine falls off a plane and destroys his bedroo m, Donnie is not there. Both the event, and Donnie's escape, seem to have been caused by supernatural events. Donnie's mental illness, if such it is, may never allow him to fi nd out for sure.","id":4},{"movieTitle":"Sword of the Stranger","movieYear":"2007","moviePoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg2NzBmYTEtMTdiNS00OTg0LWJmMzMtYTZhYzY2MjBlMjFmXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_CR0,0,675,1000_AL_.jpg","movieDescription":"A young boy and his dog find themselves the target of the Ming: a foreign dyna sty that will stop at nothing. One day, a quiet and solemn warrior crosses their path, and becomes irrevocably connected with the two. A deal is struck and the warrior agrees to take th e boy to a remote, Buddhist temple, where a kind monk is waiting to care for him and the dog. Unfortunately, the Ming have sent their elite, and they will test their strength, cou rage, and quality every step of the way.","id":5},{"movieTitle":"Harry Poter","movieYear":"2014","moviePoster":"https://cdn.shopify.com/s/files/1/2597/5112/products/hpiepstbk01_2_03286b2e-e600-4999-a128-56280ef88f2a_1200x1200.jpg?v=1517442900","movieDescription":"safdsfasdfadsf","id":6},{"movieTitle":"Cats and Dogs","movieYear":"2014","moviePoster":"https://cdn.shopify.com/s/files/1/2597/5112/products/hpiepstbk01_2_03286b2e-e600-4999-a128-56280ef88f2a_1200x1200.jpg?v=1517442900","movieDescription":"asdasdasd","id":7},{"movieTitle":"Cats and Dogs","movieYear":"2019","moviePoster":"https://cdn.pixabay.com/photo/2014/11/30/14/11/kitty-551554_640.jpg","movieDescription":"sadasdasdsa","id":8}]